app/Http/Middleware/TrackAnalytic.php

    public function handle(Request $request, Closure $next)
    {
        $sessionId = Session::getId();

        $analytic = Analytic::where('session', $sessionId)->first();

        if ($analytic) {
            $analytic->touch();
---
update `analytic` set `analytic`.`updated_at` = '2026-01-18 10:44:43' where `id` = 302