app/Providers/AnalyticServiceProvider.php

select count(*) as aggregate from `analytic` where year(`updated_at`) = 2026 and month(`updated_at`) = '01'
---
    public function boot(): void
    {
        View::composer('*', function ($view) {
            $growth = [];

            for ($i = 1; $i <= 12; $i++) {
                $monthName = now()->setMonth($i)->format('F');
                $count = Analytic::whereYear('updated_at', now()->year)->whereMonth('updated_at', $i)->count();