app/Providers/FollowerServiceProvider.php

select count(*) as aggregate from `followers`
---
    public function boot()
    {
        View::composer('*', function ($view) {
            $sessionId = Session::getId();
            $followersCount = Follower::count();